jlcbk/codex-desk-terminal/firmware/examples/board_io_skeleton/sdkconfig.defaults
# board_io_skeleton 独立工程 sdkconfig.defaults（仅编译级验证目标 esp32s3）
# 板级对齐 firmware/sdkconfig.defaults（P4.1a 真机验证值）；无 BLE/LVGL 需求。
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
